print('Задача 7. Отрезок')
print('-------------------')
# Напишите программу,
# которая считывает с клавиатуры два числа a и b,
# считает и выводит на консоль 
#среднее арифметическое всех чисел из отрезка [a; b], которые кратны числу 3.

a = int(input('Введите число a: '))
b = int(input('Введите число b: '))

for nnn in range(a,b):
  
  
  
  print(a,b)